class Messages:
    """Збірник усіх текстових фраз для інтерфейсу."""

    # Повідомлення про помилки
    ERR_EMPTY = "Ввід порожній! Монстр хоче бачити цифри."
    ERR_NOT_BIN = "Це не двійкове число! Використовуй лише 0 та 1."
    ERR_INVALID_CMD = "Пункту '{}' не існує. Обирай уважніше!"
    ERR_NO_CHOICE = "Ви нічого не ввели!"

    # Запити та інструкції
    PROMPT_INPUT = "\n Уведіть дані для розрахунку ({}):"
    PRESS_ENTER = "\n Натисніть Enter для продовження..."
    RETURN_TO_MENU = "\n [ ДІЯ ] -> Натисніть ENTER для повернення в меню"

    # Результати
    RES_GEN = "\nРЕЗУЛЬТАТ: {} (у десятковій: {})"
    RES_DIV = "\nРЕЗУЛЬТАТ: Частка {}, Остача {} (dec: {}/{})"